Problem Statement
An E-commerce website manages its data in the form of various tables.
You need to create a Database called e_commerce and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

In [1]:
import mysql.connector as sql
import pandas as pd

In [2]:
connection = sql.connect(host ="localhost",
                         user ="root",
                         password ="rahika2020",
                         database = "e_commerce4")
                        
print(connection)

<mysql.connector.connection.MySQLConnection object at 0x00000215C9C47DF0>

In [3]:
#Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.

cursor = connection.cursor()

cursor.execute("create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(100))");

In [4]:
##Q2. Insert the following data in the table created above

## Inserting data into "Supplier"
    
cursor= connection.cursor()

insert_supplier = """INSERT INTO supplier (SUPP_ID,SUPP_NAME,SUPP_CITY,SUPP_PHONE)
                  VALUES (%s,%s,%s,%s)"""
val = [(1,'Rajesh Retails','Delhi',12345678),
       (2,'Appario Ltd.','Mumbai',25896314703),
       (3,'Knome products','Bangalore',978546231),
       (4,'Bansal Retails','Kochi',897546328),
       (5,'Mittal Ltd.','Lucknow',789845653)]
 
cursor.executemany(insert_supplier,val)
connection.commit()

In [5]:
 
cursor = connection.cursor()

cursor.execute("create table customer (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))");

In [6]:
# insert into "customer" table

cursor= connection.cursor()

insert_customer = """INSERT INTO customer (CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER)
                  VALUES (%s,%s,%s,%s,%s)"""
val = [(1,'AAKASH',9999999999,'DELHI','M'),
       (2,'AMAN',9785463215,'NOIDA','M'),
       (3,'NEHA',9999999998,'MUMBAI','F'),
       (4,'MEGHA',9994562399,'KOLKATA','F'),
       (5,'PULKIT',7895999999,'LUCKNOW','M')]
 
cursor.executemany(insert_customer, val)
connection.commit()

In [8]:
   
cursor = connection.cursor()

cursor.execute("create table category (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))");

In [9]:

# insert into "category" table

cursor= connection.cursor()

insert_category = """INSERT INTO category (CAT_ID,CAT_NAME)
                  VALUES (%s,%s)"""
val = [(1,'BOOKS'),
       (2,'GAMES'),
       (3,'GROCERIES'),
       (4,'ELECTRONICS'),
       (5,'CLOTHES')]
 
cursor.executemany(insert_category, val)
connection.commit()

In [10]:
  
cursor = connection.cursor()

cursor.execute("create table product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))");

In [11]:

# insert into "product" table

cursor= connection.cursor()

insert_product = """INSERT INTO product (PRO_ID,PRO_NAME,PRO_DESC,CAT_ID)
                  VALUES (%s,%s,%s,%s)"""
val = [(1,'GTA V','DFJDJFDJFDJFDJFJF',2),
       (2,'TSHIRT','DFDFJDFJDKFD',5),
       (3,'ROG LAPTOP','DFNTTNTNTERND',4),
       (4,'OATS','REURENTBTOTH',3),
       (5,'HARRY POTTER','NBEMCTHTJTH',1)]
 
cursor.executemany(insert_product, val)
connection.commit()

In [12]:
 
cursor = connection.cursor()

cursor.execute("create table product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))");

In [13]:
# insert into "product_details" table 

cursor= connection.cursor()

insert_product_details = """INSERT INTO product_details (PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE)
                  VALUES (%s,%s,%s,%s)"""
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]
 
cursor.executemany(insert_product_details, val)
connection.commit()

In [14]:
  
cursor = connection.cursor()

cursor.execute("create table orders (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))");

In [15]:
#insert into "orders" table 

cursor= connection.cursor()

insert_orders = """INSERT INTO orders (ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID)
                  VALUES (%s,%s,%s,%s,%s)"""
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]

cursor.executemany(insert_orders, val)
connection.commit()

In [16]:
 
cursor = connection.cursor()

cursor.execute("create table rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))");

In [17]:
 # insert into "rating" table

cursor= connection.cursor()

insert_rating = """INSERT INTO rating (RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS)
                  VALUES (%s,%s,%s,%s)"""
val = [(1,2,2,4),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]
 
cursor.executemany(insert_rating, val)
connection.commit()

In [18]:
## Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

query3 = """select customer.cus_gender,count(customer.cus_gender) as count from customer
                            inner join `orders` on `customer`.cus_id = `orders`.cus_id
                            where `orders`.ord_amount >= 3000 group by customer.cus_gender;"""

cursor.execute(query3)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['CUS_GENDER','COUNT'])
output_df

  CUS_GENDER  COUNT
0          M      1
1          F      1

In [19]:
## Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

query4 = """select `orders`.*, product.pro_name from `orders`, product_details, product where `orders`.cus_id = 2 and
                               `orders`.prod_id = product_details.prod_id and product_details.prod_id = product.pro_id;"""

cursor.execute(query4)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PRO_ID','PROD_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PRO_ID PROD_NAME
0      50        2000  2021-10-06       2       1     GTA V

In [20]:
## Q5) Display the Supplier details who can supply more than one product.

query5 = """select supplier.* from supplier, product_details where supplier.SUPP_ID in 
                                 (select product_details.SUPP_ID from product_details group by product_details.SUPP_ID having
                                 count(product_details.SUPP_ID)> 1) group by supplier.SUPP_ID;"""

cursor.execute(query5)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY SUPP_PHONE
0        1  Rajesh Retails     Delhi   12345678

In [21]:
## Q6) Find the category of the product whose order amount is minimum.

query6 = """select category.* 
                         from `orders` inner join product_details on 
                         `orders`.prod_id = product_details.prod_id inner join product on 
                          product.pro_id = product_details.pro_id inner join category on
                          category.cat_id = product.cat_id 
                          having min(`orders`.ord_amount);"""

cursor.execute(query6)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['CAT_ID','CAT_NAME'])
output_df

   CAT_ID CAT_NAME
0       1    BOOKS

In [22]:
# Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

query7 = """select product.pro_id, product.pro_name from `orders` inner join product_details on 
                            product_details.prod_id = `orders`.prod_id inner join product on 
                            product.pro_id = product_details.pro_id where `orders`.ord_date > "2021-10-05";"""

cursor.execute(query7)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['PRO_ID','PRO_NAME'])
output_df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

In [23]:
## Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

query8 = """select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars
                      from rating inner join supplier on rating.supp_id=suppler.supp_id
                      inner join customer on rating.cus_id=customer.cus_id order by rating.rat_ratstars desc limit 3;"""

cursor.execute(query7)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['SUPP_ID','SUPP_NAME'])
output_df

   SUPP_ID SUPP_NAME
0        4      OATS
1        1     GTA V

In [24]:
#Query9 : Display customer name and gender whose names start or end with character 'A'.  

query9 = """select customer.cus_name, customer.cus_gender from customer where customer.cus_name like 'A%' or customer.cus_name like '%A';"""

cursor.execute(query9)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

In [25]:
## Q10) Display the total order amount of the male customers.

query10 = """select sum(orders.ord_amount) as amount
                         from orders inner join customer on orders.cus_id=customer.cus_id where customer.cus_gender='M';"""

cursor.execute(query10)
output = cursor.fetchall()

## Display Output

output_df = pd.DataFrame(output, columns=['ORDERS_AMOUNT'])
output_df

  ORDERS_AMOUNT
0         34500

In [26]:
## Q11) Display all the Customers left outer join with the orders

query11 = """select * from customer left outer join orders on customer.cus_id=orders.cus_id;"""


cursor.execute(query11)
output = cursor.fetchall()

## Display Output,,,CUS_ID,PROD_ID

output_df = pd.DataFrame(output, columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','RAT_RATSTARS','VERDICT'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,RAT_RATSTARS,VERDICT
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2